In [2]:
# pip install xlrd==1.2.0
import pandas as pd

In [3]:
import warnings
warnings.filterwarnings('ignore')

In [6]:
df1 = pd.read_excel('./EmployeeData.xlsx', sheet_name='IT')
df2 = pd.read_excel('./EmployeeData.xlsx', sheet_name='Admin')
df3 = pd.read_excel('./EmployeeData.xlsx', sheet_name='Support')

In [7]:
print(f"DF1: {df1.shape}, DF2: {df2.shape}, DF3: {df3.shape}")

DF1: (8, 4), DF2: (12, 4), DF3: (6, 4)

In [8]:
combdf = pd.concat([df1, df2, df3], axis=0).reset_index(drop=True)
print(combdf.shape)

(26, 4)

In [9]:
combdf.sample(5)

          Name     Dept  Salary    RcvDate
3      Trudi         IT    6000 2018-08-05
23    Manual    Support    7600 2018-08-07
1   Charlsie         IT    2000 2018-08-05
8   Ramonita      Admin    9500 2018-08-06
19   Rodrick      Admin    8900 2018-08-06

In [10]:
no_dup_df = combdf.drop_duplicates(subset=['Name', 'Dept', 'Salary']).reset_index(drop=True)
print(no_dup_df.shape)

(22, 4)

In [11]:
dept_groups = no_dup_df.groupby('Dept')

In [12]:
num_emps = dept_groups.count()['Name']

In [13]:
salary_range = dept_groups.min()['Salary'].astype(str) + " to " +\
               dept_groups.max()['Salary'].astype(str)

In [14]:
final_df = pd.DataFrame({'Salary_Range': salary_range,
                         'Num_of_Employees': num_emps}).reset_index()

In [15]:
display(final_df)

      Dept   Salary_Range  Num_of_Employees
0    Admin   4400 to 9500                11
1       IT  2000 to 20000                 6
2  Support   4400 to 8200                 5